* Practice Problem 3.5
#+NAME ex5
#+BEGIN_SRC C
  #include <stdio.h>

  void decode1(long *xp, long *yp, long *zp);

  void decode1(long *xp, long *yp, long *zp) {
    long a = *xp;
    long b = *yp;
    long c = *zp;
    ,*yp = a;
    ,*zp = b;
    ,*xp = c;
  }

  int main() {
    long a = 1;
    long b = 2;
    long c = 3;

    printf("%d %d %d\n", a, b, c);
    decode1(&a, &b, &c);
    printf("%d %d %d\n", a, b, c);

    return 0;
  }
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |
| 3 | 1 | 2 |
** B
#+NAME ex26
#+BEGIN_SRC C
  #include <stdio.h>

  long fun_a(unsigned long x) {
    long val = 0;
    while (x != 0) {
      val ^= x;
      x >>= 1;
    }
    return val & 1;
  }

  int main() {
    for (int i = 0; i < 30; ++i) {
      printf("%d\n", fun_a(i));
    }

    return 0;
  }
#+END_SRC

#+RESULTS:
| 0 |
| 1 |
| 1 |
| 0 |
| 1 |
| 0 |
| 0 |
| 1 |
| 1 |
| 0 |
| 0 |
| 1 |
| 0 |
| 1 |
| 1 |
| 0 |
| 1 |
| 0 |
| 0 |
| 1 |
| 0 |
| 1 |
| 1 |
| 0 |
| 0 |
| 1 |
| 1 |
| 0 |
| 1 |
| 0 |
* Practice Problem 3.27
#+NAME ex27
#+BEGIN_SRC C
  #include <stdio.h>

  long fact_for(long n) {
    long result = 1;
    long i = 2;
    goto test;
  loop:
    result *= i;
    i++;
  test:
    if (i <= n) {
      goto loop;
    }
    return result;
  }

  long fact_for_while (long n) {
    long result = 1;
    long i = 2;
    while (i <= n) {
      result *= i;
      i++;
    }
    return result;
  }

  long fact_for_gd(long n) {
    long result = 1;
    long i = 2;
    if (i > n) {
      goto done;
    }
  loop:
    result *= i;
    i++;
    if (i <= n) {
      goto loop;
    }
  done:
    return result;
  }

  int main() {
    printf("%d\n", fact_for(10));
    printf("%d\n", fact_for_while(10));
    printf("%d\n", fact_for_gd(10));

    return 0;
  }
#+END_SRC

#+RESULTS:
| 3628800 |
| 3628800 |
| 3628800 |
** A
#+NAME ex28
#+BEGIN_SRC C
  #include <stdio.h>

  long fun_b(unsigned long x) {
    long val = 0;
    long i;
    for (i = 64; i != 0; i--) {
      val += val;
      val |= x & 1;
      i >>= 1;
    }
    return val;
  }

  int main() {
    int i;
    for (i = 0; i < 10; i++) {
      printf("%d\n", fun_b(i));
    }

    return 0;
  }
#+END_SRC

#+RESULTS:
|  0 |
| 31 |
|  0 |
| 31 |
|  0 |
| 31 |
|  0 |
| 31 |
|  0 |
| 31 |

* Practice Problem 3.40
#+NAME ex40
#+BEGIN_SRC C
  #include <stdio.h>

  #define N 16
  typedef int fix_matrix[N][N];

  void fix_set_diag(fix_matrix A, int val) {
    long i;
    for (i = 0; i < N; i++) {
      A[i][i] = val;
    }
  }

  void fix_set_diag_opt(fix_matrix A, int val) {
    int *Aptr = &A[0][0];
    int *Aend = &A[N][N];
    do {
      ,*Aptr = val;
      Aptr++;
      Aptr += N;
    } while (Aptr != Aend);
  }

  int main() {
    fix_matrix a = {NULL};
    fix_matrix b = {NULL};
    int val = 16;

    fix_set_diag(a, 16);
    fix_set_diag_opt(b, 16);

    int i;
    int c;
    for (i = 0; i < N; i++) {
      printf("[%d | %d]\n", a[i][i], b[i][i]);
      for (c = 0; c < N; c++) {
        if (a[i][c] != b[i][c]) {
          printf("They're not the same");
          return 1;
        }
      }
    }

    return 0;
  }
#+END_SRC

#+RESULTS:
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
| [16 |   |   | 16] |
